In [1]:
import pandas as pd

# Joins

## One-to-one joins

In [2]:
df1 = pd.DataFrame({'employee' : ['Bob', 'Jake', 'Lisa', 'Sue'], 'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],' hire_date': [2004, 2008, 2012, 2014]})
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [3]:
df2

  employee   hire_date
0     Lisa        2004
1      Bob        2008
2     Jake        2012
3      Sue        2014

In [5]:
df3 = pd.merge(df1, df2)
df3

  employee        group   hire_date
0      Bob   Accounting        2008
1     Jake  Engineering        2012
2     Lisa  Engineering        2004
3      Sue           HR        2014

## Many-to-one joins

Many-to-one joins are joins in which one of the two key columns contains duplicate entries. For the many-to-one case, the resulting
DataFrame will preserve those duplicate entries as appropriate.

In [6]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'], 'supervisor': ['Carly', 'Guido', 'Steve']})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

## Many-to-many joins

Te key column in both the left and right
array contains duplicates

In [8]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting', 'Engineering', 'Engineering', 'HR', 'HR'],
'skills': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']})
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [9]:
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

## Specifying merge key

In [10]:
pd.merge(df1, df2, on = 'employee') # Both dfs should have 'employee'

  employee        group   hire_date
0      Bob   Accounting        2008
1     Jake  Engineering        2012
2     Lisa  Engineering        2004
3      Sue           HR        2014

## ```left_on``` and ```right_on``` - specify column names

In [12]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'], 'salary': [70000, 80000, 120000, 90000]})
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

## ```left_index``` and ```right_index``` - merge on an index

In [13]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
pd.merge(df1a, df2a, left_index=True, right_index=True)

                group   hire_date
employee
Bob        Accounting        2008
Jake      Engineering        2012
Lisa      Engineering        2004
Sue                HR        2014

df1a.join(df2a)

## Intersection (Inner join)

In [14]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'], 'food': ['fish', 'beans', 'bread']}, columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'], 'drink': ['wine', 'beer']}, columns=['name', 'drink'])
pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

## Union (Outer join)

In [15]:
pd.merge(df6, df7, how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

## Left join, Right join

In [17]:
pd.merge(df6, df7, how='left')
pd.merge(df6, df7, how='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

# Concatenate

With Series

In [18]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

With DataFrames

In [19]:
pd.concat([df1, df2])

  employee        group   hire_date
0      Bob   Accounting         NaN
1     Jake  Engineering         NaN
2     Lisa  Engineering         NaN
3      Sue           HR         NaN
0     Lisa          NaN      2004.0
1      Bob          NaN      2008.0
2     Jake          NaN      2012.0
3      Sue          NaN      2014.0

By default, the concatenation takes place row-wise within the DataFrame (i.e., ```axis=0```). ```pd.concat``` allows
specification of an axis along which concatenation will take place. Also, note that the index is duplicated. This can be avoided be setting ```ignore_index=True```.

In [ ]:
df2

  employee   hire_date
0     Lisa        2004
1      Bob        2008
2     Jake        2012
3      Sue        2014

In [20]:
pd.concat([df1, df2],axis = 1)

  employee        group employee   hire_date
0      Bob   Accounting     Lisa        2004
1     Jake  Engineering      Bob        2008
2     Lisa  Engineering     Jake        2012
3      Sue           HR      Sue        2014

# Append

In [ ]:
df1.append(df2)

  employee        group   hire_date
0      Bob   Accounting         NaN
1     Jake  Engineering         NaN
2     Lisa  Engineering         NaN
3      Sue           HR         NaN
0     Lisa          NaN      2004.0
1      Bob          NaN      2008.0
2     Jake          NaN      2012.0
3      Sue          NaN      2014.0